In [2]:
import numpy as np
import pandas as pd

df.isnull() → returns a boolean DataFrame showing missing values.

df.isnull().sum() → counts missing values per column.

df.isnull().any() → checks which columns have missing values.

In [3]:
data={
    "name":["Alice", "Bob", "Charlie", "David", "ad"],
    "Age": [25, None, 30, 22, 28],
    "Country": ["India", "USA", None, "UK", "India"]
    
}
a=pd.Series(data)
a.to_frame()

                                        0
name     [Alice, Bob, Charlie, David, ad]
Age                [25, None, 30, 22, 28]
Country     [India, USA, None, UK, India]

In [4]:
df=pd.DataFrame(data)
df

      name   Age Country
0    Alice  25.0   India
1      Bob   NaN     USA
2  Charlie  30.0    None
3    David  22.0      UK
4       ad  28.0   India

In [5]:
print(df.isnull())

    name    Age  Country
0  False  False    False
1  False   True    False
2  False  False     True
3  False  False    False
4  False  False    False

In [6]:
print(df.isnull().sum())

name       0
Age        1
Country    1
dtype: int64

In [7]:
df_drop_rows = df.dropna()
print(df_drop_rows)

    name   Age Country
0  Alice  25.0   India
3  David  22.0      UK
4     ad  28.0   India

In [8]:
df_drop_cols = df.dropna(axis=1)
print(df_drop_cols)

      name
0    Alice
1      Bob
2  Charlie
3    David
4       ad

### Create a DataFrame with some missing values.

In [9]:

# Create a dictionary with some missing values (None or np.nan)
data = {
    "Name": ["Alice", "Bob", "Charlie", None, "Eva"],
    "Age": [25, np.nan, 30, 22, None],
    "Country": ["India", "USA", None, "UK", "India"]
}

# Create the DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
df

      Name   Age Country
0    Alice  25.0   India
1      Bob   NaN     USA
2  Charlie  30.0    None
3     None  22.0      UK
4      Eva   NaN   India

In [10]:
ind=[1,2,3,4,5]
df.index=ind
df

      Name   Age Country
1    Alice  25.0   India
2      Bob   NaN     USA
3  Charlie  30.0    None
4     None  22.0      UK
5      Eva   NaN   India

In [11]:
df.columns=["name","age","country"]
df

      name   age country
1    Alice  25.0   India
2      Bob   NaN     USA
3  Charlie  30.0    None
4     None  22.0      UK
5      Eva   NaN   India

### Drop rows with missing values.

In [12]:

# Create a dictionary with some missing values (None or np.nan)
data = {
    "Name": ["Alice", "Bob", "Charlie", None, "Eva"],
    "Age": [25, np.nan, 30, 22, None],
    "Country": ["India", "USA", None, "UK", "India"]
}

# Create the DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
df

      Name   Age Country
0    Alice  25.0   India
1      Bob   NaN     USA
2  Charlie  30.0    None
3     None  22.0      UK
4      Eva   NaN   India

In [13]:
df.dropna(axis=0)

    Name   Age Country
0  Alice  25.0   India

### Fill missing values with mean/median.

In [14]:
# Create a dictionary with some missing values (None or np.nan)
data = {
    "Name": ["Alice", "Bob", "Charlie", None, "Eva"],
    "Age": [25, np.nan, 30, 22, None],
    "Country": ["India", "USA", None, "UK", "India"]
}

# Create the DataFrame
df = pd.DataFrame(data)


# Display the DataFrame
df

      Name   Age Country
0    Alice  25.0   India
1      Bob   NaN     USA
2  Charlie  30.0    None
3     None  22.0      UK
4      Eva   NaN   India

In [15]:
mean=int(df["Age"].mean())
mean

25

In [16]:
df1=df["Age"]=df["Age"].fillna(mean)
df1
df

      Name   Age Country
0    Alice  25.0   India
1      Bob  25.0     USA
2  Charlie  30.0    None
3     None  22.0      UK
4      Eva  25.0   India

In [17]:
## median

In [18]:
median=df["Age"].median()+1
median

26.0

In [19]:
df["Age"]=df["Age"].fillna(median)

In [20]:
print(df)

      Name   Age Country
0    Alice  25.0   India
1      Bob  25.0     USA
2  Charlie  30.0    None
3     None  22.0      UK
4      Eva  25.0   India

In [21]:
mean_age = df["Age"].mean()  # Calculate mean ignoring NaN
df["Age_mean"] = df["Age"].fillna(mean_age)
print("\nFilled with Mean:")
print(df)

Filled with Mean:
      Name   Age Country  Age_mean
0    Alice  25.0   India      25.0
1      Bob  25.0     USA      25.0
2  Charlie  30.0    None      30.0
3     None  22.0      UK      22.0
4      Eva  25.0   India      25.0

In [22]:
median_age = df["Age"].median()  # Calculate median ignoring NaN
df["Age_median"] = df["Age"].fillna(25)
print("\nFilled with Median:")
print(df)

Filled with Median:
      Name   Age Country  Age_mean  Age_median
0    Alice  25.0   India      25.0        25.0
1      Bob  25.0     USA      25.0        25.0
2  Charlie  30.0    None      30.0        30.0
3     None  22.0      UK      22.0        22.0
4      Eva  25.0   India      25.0        25.0

In [23]:
# Create a dictionary with some missing values (None or np.nan)
data = {
    "Name": ["Alice", "Bob", "Charlie", None, "Eva"],
    "Age": [25, np.nan, 30, 22, None],
    "Country": ["India", "USA", None, "UK", "India"]
}

# Create the DataFrame
df1 = pd.DataFrame(data)


# Display the DataFrame
df1

      Name   Age Country
0    Alice  25.0   India
1      Bob   NaN     USA
2  Charlie  30.0    None
3     None  22.0      UK
4      Eva   NaN   India

In [24]:
df1["Age"]=df1["Age"].fillna(0)

In [25]:
df1

      Name   Age Country
0    Alice  25.0   India
1      Bob   0.0     USA
2  Charlie  30.0    None
3     None  22.0      UK
4      Eva   0.0   India

In [26]:
# Create a dictionary with some missing values (None or np.nan)
data = {
    "Name": ["Alice", "Bob", "Charlie", None, "Eva"],
    "Age": [25, np.nan, 30, 22, None],
    "Country": ["India", "USA", None, "UK", "India"]
}

# Create the DataFrame
df1 = pd.DataFrame(data)


# Display the DataFrame
df1
meann=df["Age"].sum()
df1["avg"]=1
df1

      Name   Age Country  avg
0    Alice  25.0   India    1
1      Bob   NaN     USA    1
2  Charlie  30.0    None    1
3     None  22.0      UK    1
4      Eva   NaN   India    1


### Check for null values in a DataFrame.

In [27]:
print(df.isnull())

    Name    Age  Country  Age_mean  Age_median
0  False  False    False     False       False
1  False  False    False     False       False
2  False  False     True     False       False
3   True  False    False     False       False
4  False  False    False     False       False

In [28]:
print(df.isnull().sum())

Name          1
Age           0
Country       1
Age_mean      0
Age_median    0
dtype: int64

In [29]:
print((df.isnull().any()).any())  # True if any missing value exists

True

#### Drop all rows where more than 1 column has missing values.

In [30]:
df.dropna(thresh=0)

      Name   Age Country  Age_mean  Age_median
0    Alice  25.0   India      25.0        25.0
1      Bob  25.0     USA      25.0        25.0
2  Charlie  30.0    None      30.0        30.0
3     None  22.0      UK      22.0        22.0
4      Eva  25.0   India      25.0        25.0

In [31]:
import pandas as pd
import numpy as np

# Sample DataFrame with missing values
data = {
    "Name": ["Alice", "Bob", None, "David", "Eva"],
    "Age": [25, np.nan, 30, 22, None],
    "Country": ["India", "USA", None, "UK", "India"]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)
# Keep rows with at least 2 non-missing values
df_cleaned = df.dropna(thresh=2)
print("\nDataFrame after dropping rows with >1 missing value:")
print(df_cleaned)

Original DataFrame:
    Name   Age Country
0  Alice  25.0   India
1    Bob   NaN     USA
2   None  30.0    None
3  David  22.0      UK
4    Eva   NaN   India

DataFrame after dropping rows with >1 missing value:
    Name   Age Country
0  Alice  25.0   India
1    Bob   NaN     USA
3  David  22.0      UK
4    Eva   NaN   India

#### Replace missing values in a column with the previous row’s value (ffill).

In [32]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, np.nan, 92, np.nan]
}
df = pd.DataFrame(data)

print("Original DataFrame:")
df

Original DataFrame:

      Name  Score
0    Alice   85.0
1      Bob    NaN
2  Charlie   92.0
3    David    NaN

In [33]:

print(df)

      Name  Score
0    Alice   85.0
1      Bob    NaN
2  Charlie   92.0
3    David    NaN

In [34]:
df.ffill(inplace=True)  # forward fill all columns
df

      Name  Score
0    Alice   85.0
1      Bob   85.0
2  Charlie   92.0
3    David   92.0

#### ffill()

In [35]:
df = pd.DataFrame({
    'City': ['Delhi', 'Mumbai', 'Chennai', 'Kolkata'],
    'Temperature': [35, np.nan, 30, np.nan]
})
print(df)

      City  Temperature
0    Delhi         35.0
1   Mumbai          NaN
2  Chennai         30.0
3  Kolkata          NaN

In [36]:
df.ffill()

      City  Temperature
0    Delhi         35.0
1   Mumbai         35.0
2  Chennai         30.0
3  Kolkata         30.0

#### fillna

In [37]:
df = pd.DataFrame({
    'Day': ['Mon','Tue','Wed','Thu'],
    'StockPrice': [100, np.nan, np.nan, 105]
})
print(df)

   Day  StockPrice
0  Mon       100.0
1  Tue         NaN
2  Wed         NaN
3  Thu       105.0

In [38]:
df.fillna(2)

   Day  StockPrice
0  Mon       100.0
1  Tue         2.0
2  Wed         2.0
3  Thu       105.0

#### bfill

In [39]:
df = pd.DataFrame({
    'Student': ['A', 'B', 'C', 'D'],
    'Attendance': [np.nan, 85, np.nan, 90]
})
df

  Student  Attendance
0       A         NaN
1       B        85.0
2       C         NaN
3       D        90.0

In [40]:
df1=df.bfill()
df1

  Student  Attendance
0       A        85.0
1       B        85.0
2       C        90.0
3       D        90.0

#### 4️⃣ Column-specific values using a dictionary

In [69]:
df = pd.DataFrame({
    'Product': ['Pen','Pencil','Eraser'],
    'Sales': [100, np.nan, 50],
    'Profit': [np.nan, 20, np.nan],
     'Profit': [20, 20, np.nan]
})


df

  Product  Sales  Profit
0     Pen  100.0    20.0
1  Pencil    NaN    20.0
2  Eraser   50.0     NaN

In [70]:
df_filled

  Product  Sales  Profit
0     Pen  100.0     5.0
1  Pencil    0.0    20.0
2  Eraser   50.0     5.0

In [116]:
import pandas as pd

# Sample DataFrame
data = {
    "Name": ["Asha","Ramesh","Salim","Meera"],
    "Department": ["IT","HR","IT","HR"],
    "Salary": [50000,60000,55000,45000]
}
df = pd.DataFrame(data)

# Group by Department and get department mean salary
df.groupby('Department')['Salary'].transform('mean')

0    52500.0
1    52500.0
2    52500.0
3    52500.0
Name: Salary, dtype: float64

In [72]:
df.apply("sum")

Product    PenPencilEraser
Sales                150.0
Profit                40.0
dtype: object

In [73]:
df.sum(numeric_only=True)

Sales     150.0
Profit     40.0
dtype: float64

In [74]:
df.replace(100,1001)

  Product   Sales  Profit
0     Pen  1001.0    20.0
1  Pencil     NaN    20.0
2  Eraser    50.0     NaN

In [80]:
a=df.rename(columns={"Product":"pd"})

In [81]:
a

       pd  Sales  Profit
0     Pen  100.0    20.0
1  Pencil    NaN    20.0
2  Eraser   50.0     NaN

In [82]:
import pandas as pd

# Sample employee data
data = {
    "Name": ["Asha", "Ramesh", "Salim", "Meera", "John"],
    "Department": ["IT", "HR", "IT", "HR", "Finance"],
    "Salary": [50000, 60000, 55000, 45000, 70000]
}

df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

# 🔸 Grouping by Department and aggregating salaries
avg_salary = df.groupby("Department")["Salary"].mean()

print("\nAverage Salary per Department:")
print(avg_salary)

# 🔸 Multiple aggregations
multi_agg = df.groupby("Department")["Salary"].agg(["mean", "max", "min", "count"])

print("\nMultiple Aggregations per Department:")
print(multi_agg)

Original DataFrame:
     Name Department  Salary
0    Asha         IT   50000
1  Ramesh         HR   60000
2   Salim         IT   55000
3   Meera         HR   45000
4    John    Finance   70000

Average Salary per Department:
Department
Finance    70000.0
HR         52500.0
IT         52500.0
Name: Salary, dtype: float64

Multiple Aggregations per Department:
               mean    max    min  count
Department
Finance     70000.0  70000  70000      1
HR          52500.0  60000  45000      2
IT          52500.0  55000  50000      2

In [91]:
a=(df[df['Name'].str.endswith("a")])["Name"]

In [92]:
df.stack()

0  Name             Asha
   Department         IT
   Salary          50000
1  Name           Ramesh
   Department         HR
   Salary          60000
2  Name            Salim
   Department         IT
   Salary          55000
3  Name            Meera
   Department         HR
   Salary          45000
4  Name             John
   Department    Finance
   Salary          70000
dtype: object

In [93]:
df.unstack()

Name        0       Asha
            1     Ramesh
            2      Salim
            3      Meera
            4       John
Department  0         IT
            1         HR
            2         IT
            3         HR
            4    Finance
Salary      0      50000
            1      60000
            2      55000
            3      45000
            4      70000
dtype: object

In [94]:
df.dtypes

Name          object
Department    object
Salary         int64
dtype: object

In [96]:
df["Salary"].astype("int16")

0   -15536
1    -5536
2   -10536
3   -20536
4     4464
Name: Salary, dtype: int16

In [119]:
import pandas as pd

df = pd.DataFrame({
    'Color': ['Red', 'Blue', 'Green', 'Red', 'Blue'],
    'Car':['honda','susuki','hundai','skoda','mg']
})

# Convert to categorical
df['Color'] = df['Color'].astype('category')

print(df['Color'])
print(df['Color'].cat.categories)  # Shows unique categories

0      Red
1     Blue
2    Green
3      Red
4     Blue
Name: Color, dtype: category
Categories (3, object): ['Blue', 'Green', 'Red']
Index(['Blue', 'Green', 'Red'], dtype='object')

In [120]:
df.stack()

0  Color       Red
   Car       honda
1  Color      Blue
   Car      susuki
2  Color     Green
   Car      hundai
3  Color       Red
   Car       skoda
4  Color      Blue
   Car          mg
dtype: object

In [121]:
df.unstack()

Color  0       Red
       1      Blue
       2     Green
       3       Red
       4      Blue
Car    0     honda
       1    susuki
       2    hundai
       3     skoda
       4        mg
dtype: object

In [ ]:
df.sum(numeric_only=True)

Series([], dtype: float64)

<bound method DataFrame.reset_index of    Color     Car
0    Red   honda
1   Blue  susuki
2  Green  hundai
3    Red   skoda
4   Blue      mg>

In [162]:
data = {
    "Name": ["Asha", "Ramesh", "Salim", "Meera", "John"],
    "Department": ["IT", "HR", "IT", "HR", "Finance"],
    "Salary": [50000, 60000, 55000, 45000, 70000]
}

df = pd.DataFrame(data)
df

     Name Department  Salary
0    Asha         IT   50000
1  Ramesh         HR   60000
2   Salim         IT   55000
3   Meera         HR   45000
4    John    Finance   70000

In [147]:
df.query("Salary>60000")

   Name Department  Salary
4  John    Finance   70000

In [152]:
df['Salary']=df['Salary'].mask(df['Salary']>=55000)

In [153]:
df

     Name Department   Salary
0    Asha         IT  50000.0
1  Ramesh         HR      NaN
2   Salim         IT      NaN
3   Meera         HR  45000.0
4    John    Finance      NaN

In [170]:
df['Salary_gruop']=np.where(df['Salary']>55000,'senor','junior')

In [171]:
df

     Name Department  Salary Salary_gruop
0    Asha         IT   50000       junior
1  Ramesh         HR   60000        senor
2   Salim         IT   55000       junior
3   Meera         HR   45000       junior
4    John    Finance   70000        senor

In [189]:
# Left DataFrame
df1 = pd.DataFrame({
    "ID": [1, 2, 3, 4],
    "Name": ["A", "B", "C", "D"]
})

# Right DataFrame
df2 = pd.DataFrame({
    "IDs": [3, 4, 5, 6],
    "Salary": [50000, 60000, 70000, 80000]
})

In [183]:
pd.merge(df1,df2, right_on='IDs',left_on='ID')

   ID Name  IDs  Salary
0   3    C    3   50000
1   4    D    4   60000

In [192]:
pd.concat([df1,df2],join='outer')

    ID Name  IDs   Salary
0  1.0    A  NaN      NaN
1  2.0    B  NaN      NaN
2  3.0    C  NaN      NaN
3  4.0    D  NaN      NaN
0  NaN  NaN  3.0  50000.0
1  NaN  NaN  4.0  60000.0
2  NaN  NaN  5.0  70000.0
3  NaN  NaN  6.0  80000.0

In [206]:
data = {
    "Name": ["Asha", "Ramesh", "Salim", "Meera", "John"],
    "Department": ["IT", "HR", "IT", "HR", "Finance"],
    "Salary": [50000, 60000, 55000, 45000, 70000]
}

df = pd.DataFrame(data,index=['a','b','c','d','e'])
df

     Name Department  Salary
a    Asha         IT   50000
b  Ramesh         HR   60000
c   Salim         IT   55000
d   Meera         HR   45000
e    John    Finance   70000

In [210]:
df.iloc[0]

Name           Asha
Department       IT
Salary        50000
Name: a, dtype: object

In [211]:
import pandas as ps

# Sample DataFrame
data = {
    "Name": ["Asha","Ramesh","Salim","Meera"],
    "Department": ["IT","HR","IT","HR"],
    "Salary": [50000,60000,55000,45000]
}
df = ps.DataFrame(data)

# Group by Department and get department mean salary
df['Dept_mean_salary'] = df.groupby('Department')['Salary'].transform('mean')

print(df)

     Name Department  Salary  Dept_mean_salary
0    Asha         IT   50000           52500.0
1  Ramesh         HR   60000           52500.0
2   Salim         IT   55000           52500.0
3   Meera         HR   45000           52500.0